#ifndef INFORMATION
#define INFORMATION

/*
 * Информация о программе
 *
 * Программа получает на вход текстовый документ,который хранит путь к изображениям карты.
 * Программа также получает на вход текстовый gcp файл, который хранит координаты меток вида : Долгота Широта Высота px py mapName
 *
 * Когда map и gcp файл выбраны,программа выводит метки,указанные в gcp файле на условной карте
 *
 * Что сделано:
 *
 * + Базовый интерфейс
 *
 * + Выбор документа с путями к изображениям
 * + Выбор gcp документа.
 *
 * + Чтение и отображение меток на условной карте (тема с OpenDroneMap чересчур размыта + нет обратной связи => отсутствие настоящей или желаемой карты).
 * + Добавление новых изображений к существующей карте.
 *
 * Что не сделано:
 *
 * - Графическое удаление меток
 * - Всё,что может прийти в голову
 *
 *
 *
 *
 *
 *
 * Спасибо за просмотр данного, скорее всего , некрасивого и недореализованого проекта :D
 */

#endif // INFORMATION

